---
kind: property
id: P:Autodesk.Revit.DB.RoofBase.EaveCuts
source: html/48e62aee-7b77-53b4-e260-9af795475af6.htm
---
# Autodesk.Revit.DB.RoofBase.EaveCuts Property

Retrieve or set the EaveCutterType.

## Syntax (C#)
```csharp
public EaveCutterType EaveCuts { get; set; }
```